#### Create a list of five random numbers and then subtract the lenght of the list from each item in the list created

In [16]:
#STEP 1: Create a list
mynum = [100, 56, 70, 19, 20]

#STEP 2: Get the length of the list
num_len = len(mynum)

#STEP3:
for num in mynum: #mynum is the data structure to iterate on
    print(num - num_len) #The body of the loop

95
51
65
14
15

#### Functions
- user defined Functions: Functions we build ourselves
- In-built Functions: predefined Functions

In [18]:
## Define a function that display hello world

def greeter():
    print ("Hello World") # body of the function
    return # The return keyword marks the end of a function

In [19]:
greeter() # call/invoke the function

Hello World

In [29]:
# one step Forword: we use input parameters now
def greeter2(name):
    print ("Hello", name)
    return

In [30]:
greeter2(name = "Thota") # call the function

Hello Thota

In [31]:
#### Define a function that returns the sum of any two numbers
def summer(x,y):
    result = x+y
    return result

In [33]:
summer(x=50, y= 10)

60

### Define a function that returns the square root of a number

In [34]:
def squareroot(x):
    result = x ** 0.5
    return result

In [39]:
squareroot (25)

5.0

In [38]:
#STEP 1: Create a list
myno = [100, 25, 36, 49, 4]

#STEP 2: Get the length of the list
num_len = len(myno)

#STEP3:
for i in myno: #mynum is the data structure to iterate on
    print(squareroot(i)) #The body of the loop

10.0
5.0
6.0
7.0
2.0

### A few more functions

In [40]:
#split(); cuts a string into a list based on a delimeter

sentence = "this is my first attempt with python"

#split sentence
sentence.split(" ")

['this', 'is', 'my', 'first', 'attempt', 'with', 'python']

In [41]:
bio = "Avinash Thota Ph No"
bio.split(" ")

['Avinash', 'Thota', 'Ph', 'No']

#### Split the url provided using (/) as a delimeter

In [44]:
url = "https://en.wikipedia.org/wiki/UEFA_European_Championship"
url.split("/")

['https:', '', 'en.wikipedia.org', 'wiki', 'UEFA_European_Championship']

In [48]:
url_split = url.split("/")

#join the strings back using the join functions
"/".join(url_split)

'https://en.wikipedia.org/wiki/UEFA_European_Championship'

In [49]:
# replace 

statement = "I love writing python"

#replace the pythin with java
statement.replace("python", "java")

'I love writing java'

#### you have been provided with a string of words. find a way to append ing to each word in string

In [61]:
actions_new ='go act climb roll sing jump'

step1 = actions_new.split (" ")
step1

['go', 'act', 'climb', 'roll', 'sing', 'jump']

In [62]:
for word in step1:
    print ( word + "ing")

going
acting
climbing
rolling
singing
jumping

In [64]:
## reversing a string
word = "THOTA"

word[::-1]

'ATOHT'

#### Write a function that checks if a word is a palindrome

In [65]:
word = "Thota"

#obtain the reversed version of the word
reverse_word = word[::-1]

if word == reverse_word:
    print ("palindrome")
else:
    print ("Not palindrome")

Not palindrome

In [66]:
word = "MADAM"

#obtain the reversed version of the word
reverse_word = word[::-1]

if word == reverse_word:
    print ("palindrome")
else:
    print ("Not palindrome")

palindrome

### combine the palindrome process into a function

In [83]:
def palindrome(word):
    reverse_word = word[::-1]
    
    if word == reverse_word:
        print("palindrome")
    else:
        print("Not palindrome")
    return

In [84]:
palindrome("mom")

palindrome

### pandas

In [89]:
# How to import pandas
import pandas as pd

#read in the data
df = pd.read_excel("SalesForecast_RawData.xlsx")
df

     ResellerOrOnline            Name  Month  Year        Revenue
0                   0       Australia      5  2013   49824.713775
1                   0       Australia      6  2013  134280.982239
2                   0       Australia      7  2013  266778.707809
3                   0       Australia      8  2013   55341.462000
4                   0       Australia      9  2013  124225.104000
..                ...             ...    ...   ...            ...
547                 1  United Kingdom      2  2014  175784.400000
548                 1  United Kingdom      3  2014  188023.700000
549                 1  United Kingdom      4  2014  206451.510000
550                 1  United Kingdom      5  2014  262427.320000
551                 1  United Kingdom      6  2014    4169.950000

[552 rows x 5 columns]

In [90]:
#head
df.head()

   ResellerOrOnline       Name  Month  Year        Revenue
0                 0  Australia      5  2013   49824.713775
1                 0  Australia      6  2013  134280.982239
2                 0  Australia      7  2013  266778.707809
3                 0  Australia      8  2013   55341.462000
4                 0  Australia      9  2013  124225.104000

In [91]:
#tail
df.tail()

     ResellerOrOnline            Name  Month  Year    Revenue
547                 1  United Kingdom      2  2014  175784.40
548                 1  United Kingdom      3  2014  188023.70
549                 1  United Kingdom      4  2014  206451.51
550                 1  United Kingdom      5  2014  262427.32
551                 1  United Kingdom      6  2014    4169.95

In [92]:
#dimensions: number of rows and columns
df.shape

(552, 5)

In [93]:
#describe: summary statistics
df.describe()

       ResellerOrOnline       Month         Year       Revenue
count        552.000000  552.000000   552.000000  5.520000e+02
mean           0.525362    6.485507  2012.534420  1.989528e+05
std            0.499809    3.400086     0.928815  1.935884e+05
min            0.000000    1.000000  2011.000000  7.280000e+00
25%            0.000000    4.000000  2012.000000  5.535895e+04
50%            1.000000    6.000000  2013.000000  1.461063e+05
75%            1.000000    9.000000  2013.000000  2.668921e+05
max            1.000000   12.000000  2014.000000  1.142686e+06

In [94]:
# Index columns
df.Name

0           Australia
1           Australia
2           Australia
3           Australia
4           Australia
            ...
547    United Kingdom
548    United Kingdom
549    United Kingdom
550    United Kingdom
551    United Kingdom
Name: Name, Length: 552, dtype: object

In [95]:
df.Year

0      2013
1      2013
2      2013
3      2013
4      2013
       ...
547    2014
548    2014
549    2014
550    2014
551    2014
Name: Year, Length: 552, dtype: int64

In [97]:
#Distinct count
#retrieve all the distinct years
df.Year.unique()

array([2013, 2014, 2011, 2012], dtype=int64)

In [98]:
#distinct count
df.Year.nunique()

4

In [99]:
# preview the column names
df.columns

Index(['ResellerOrOnline', 'Name', 'Month', 'Year', 'Revenue'], dtype='object')